Revit 2024 API
StructuralSectionConcreteRectangleCut.TopCutHeight Property
 Section height right Cut.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double TopCutHeight { get; set; }
Visual Basic
Public Property TopCutHeight As Double
	Get
	Set
Visual C++
public:
property double TopCutHeight {
	double get ();
	void set (double value);
}
See Also
StructuralSectionConcreteRectangleCut Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace